testCases/T3A/mykkLOmega/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
        maxIter          100;
    }

    U
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1.e-8;
        relTol           0.01;
    }

    "(kt|kl|omega)"
    {
        $U;
        minIter          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefCell        0;
    pRefValue       0;

    consistent      yes;

}

relaxationFactors
{
    fields
    {
        p               1.0;
    }
    equations
    {
        U               0.8;
        kt              0.8;
        kl              0.8;
        omega           0.8;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
