testCases/T3A/mykkLOmega/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (wallShearStress);

    //interpolationScheme xcell;

    surfaces
    (
        plate
        {
            type            patch;
            patches         ("flatPlate");
            interpolate     false;
        }
    );
}

// ************************************************************************* //
